Merge pull request #104 from maxgherman/swr-swrt
Swr swrt
